# GetClTextureG

## Description
Function GetClTextureG returns the generic texture of the specified class.

```pascal
FUNCTION GetClTextureG(className : STRING) : LONGINT;
```

```python

def vs.GetClTextureG(className):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Class name.|

## Remarks
Returns the generic texture of the class named className.

## Version
Availability: from VectorWorks8.0
## Category
* Textures